package com.snowalker.shardingjdbc.snowalker.demo.enums;

/***
 * 错误代码-核心框架(范围 E000001 - E009999)
 * 错误代码-财务中心(范围 E010001 - E019999)
 * 错误代码-接口中心(范围 E020001 - E029999)
 * 错误代码-项目中心(范围 E030001 - E039999)
 * 错误代码-运输中心(范围 E040001 - E049999)
 * 错误代码-用户中心(范围 E050001 - E059999)
 * 错误代码-竞价中心(范围 E110001 - E119999)
 */
public enum ErrorCodeEnum {

    //核心框架
    E000001("E000001", "查询【{}】时发生错误，请稍后重试"),
    E000002("E000002", "查看【{}】时发生错误，请稍后重试"),
    E000003("E000003", "保存【{}】时发生错误"),
    E000004("E000004", "新增【{}】时发生错误"),
    E000005("E000005", "修改【{}】时发生错误"),
    E000006("E000006", "删除【{}】时发生错误"),
    E000007("E000007", "【{}】记录不存在"),
    E000008("E000008", "查询服务【{}】不可用"),
    E000009("E000009", "系统内部错误"),
    E000010("E000010", "系统服务不可用"),
    E000011("E000011", "其他用户正在修改相同数据，请重试"),
    E000012("E000012", "新增{}时发生错误，{}"),
    E000400("E000400", "参数填写错误"),
    E000403("E000403", "无访问该数据权限"),
    E000404("E000404", "{}"),
    E000405("E000405", "请求类型不正确"),
    E000406("E000406", "请求中的参数中含有非法字符"),



    //结束
    ;

    private String err;
    private String msg;
    ErrorCodeEnum(String err, String msg) {
        this.err = err;
        this.msg = msg;
    }
    public String getErr() {
        return err;
    }
    public String getMsg() {
        return msg;
    }

}
